antaris-inc/SatOS-HAL/drivers/exo_hal_driver_fw/exo_io_al_driver_api/exo_io_al_wrapper/exo_io_al_stm32f7xx/uart/src/exo_io_al_stm32f7xx_uart.c
/**
 * @file exo_io_al_stm32f7xx_uart.c
 *
 * @brief This file contains wrapper function definition for UART interface
 *
 * @copyright Copyright 2024 Antaris, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "exo_io_al_stm32f7xx_uart.h"

#include "stm32f7xx_hal.h"
#include "exo_osal.h"
#include "exo_common.h"

/**
 * @brief USART6 Initialization Function
 *
 * @param[out] ioal_uart6 : pointer to UART handler
 */
static void MX_USART6_Init(ioal_uart_hdle *ioal_uart6);

/**
 * @brief USART1 Initialization Function
 *
 * @param[out] ioal_uart1 : pointer to UART handler
 */
static void MX_USART1_Init(ioal_uart_hdle *ioal_uart1);

/**
 * @brief USART4 Initialization Function
 *
 * @param[out] ioal_uart4 : pointer to UART handler
 */
static void MX_USART4_Init(ioal_uart_hdle *ioal_uart4);

/**
 * @brief USART5 Initialization Function
 *
 * @param[out] ioal_uart5 : pointer to UART handler
 */
static void MX_USART5_Init(ioal_uart_hdle *ioal_uart5);


/**
 * @brief TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * @retval No return
 */
void io_hal_stm32f7xx_uart1_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief RX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart1_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart1_abort_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart1_abort_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort RX  complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart1_abort_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Error callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart1_error_cb(UART_HandleTypeDef *huart);

/**
 * @brief TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * @retval No return
 */
void io_hal_stm32f7xx_uart2_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief RX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart2_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart2_abort_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart2_abort_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort RX  complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart2_abort_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Error callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart2_error_cb(UART_HandleTypeDef *huart);

/**
 * @brief TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * @retval No return
 */
void io_hal_stm32f7xx_uart3_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief RX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart3_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart3_abort_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart3_abort_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort RX  complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART

