antaris-inc/SatOS-HAL/drivers/exo_hal_driver_fw/exo_io_al_driver_api/exo_io_al_wrapper/exo_io_al_stm32f7xx/uart/src/exo_io_al_stm32f7xx_uart.c
 * @retval No return
 */
void io_hal_stm32f7xx_uart3_abort_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Error callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart3_error_cb(UART_HandleTypeDef *huart);

/**
 * @brief TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * @retval No return
 */
void io_hal_stm32f7xx_uart4_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief RX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart4_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart4_abort_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart4_abort_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort RX  complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart4_abort_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Error callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart4_error_cb(UART_HandleTypeDef *huart);

/**
 * @brief TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * @retval No return
 */
void io_hal_stm32f7xx_uart5_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief RX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart5_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart5_abort_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart5_abort_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort RX  complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart5_abort_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Error callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart5_error_cb(UART_HandleTypeDef *huart);

/**
 * @brief TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * @retval No return
 */
void io_hal_stm32f7xx_uart6_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief RX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart6_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart6_abort_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort TX complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart6_abort_tx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Abort RX  complete callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart6_abort_rx_cplt_cb(UART_HandleTypeDef *huart);

/**
 * @brief Error callback event function
 * @param[in] huart - huart pointer to a UART_HandleTypeDef structure that contains
 * 			the configuration information for UART
 * @retval No return
 */
void io_hal_stm32f7xx_uart6_error_cb(UART_HandleTypeDef *huart);

UART_HandleTypeDef huart6;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart4;
UART_HandleTypeDef huart5;

/**
 * @brief This API initialize the control block memory of UART6
 */     
hal_ret_sts io_hal_stm32f7xx_uart6_init(ioal_uart_hdle *ioal_huart6)
{
    hal_ret_sts ret_sts = HAL_IO_INVLD_ARG;
    if(ioal_huart6 != NULL)
    {
        MX_USART6_Init(ioal_huart6);
        io_hal_stm32f7xx_uart6_reg_cb();
        ret_sts = HAL_SCS;
    }
    return ret_sts;
}

/**
 * @brief This API initialize the control block memory of UART1
 */     
hal_ret_sts io_hal_stm32f7xx_uart1_init(ioal_uart_hdle *ioal_huart1)
{
    hal_ret_sts ret_sts = HAL_IO_INVLD_ARG;
    if(ioal_huart1 != NULL)
    {
        MX_USART1_Init(ioal_huart1);
        io_hal_stm32f7xx_uart1_reg_cb();
        ret_sts = HAL_SCS;
    }
    return ret_sts;
}
/**
 * @brief This API initialize the control block memory of UART4
 */     
hal_ret_sts io_hal_stm32f7xx_uart4_init(ioal_uart_hdle *ioal_huart4)
{
    hal_ret_sts ret_sts = HAL_IO_INVLD_ARG;
    if(ioal_huart4 != NULL)
    {
        MX_USART4_Init(ioal_huart4);
        io_hal_stm32f7xx_uart4_reg_cb();
        ret_sts = HAL_SCS;
    }
    return ret_sts;
}
/**
 * @brief This API initialize the control block memory of UART5
 */     
hal_ret_sts io_hal_stm32f7xx_uart5_init(ioal_uart_hdle *ioal_huart5)
{
    hal_ret_sts ret_sts = HAL_IO_INVLD_ARG;
    if(ioal_huart5 != NULL)
    {
        MX_USART5_Init(ioal_huart5);
        io_hal_stm32f7xx_uart5_reg_cb();
        ret_sts = HAL_SCS;
    }
    return ret_sts;
}

/**
 * @brief USART6 Initialization Function
 */
static void MX_USART6_Init(ioal_uart_hdle *ioal_huart6)
{
    huart6.Instance = USART6;
    huart6.Init.BaudRate = 115200;
    huart6.Init.WordLength = UART_WORDLENGTH_8B;
    huart6.Init.StopBits = UART_STOPBITS_1;
    huart6.Init.Parity = UART_PARITY_NONE;
    huart6.Init.Mode = UART_MODE_TX_RX;
    huart6.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart6.Init.OverSampling = UART_OVERSAMPLING_16;
    huart6.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart6.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(&huart6) != HAL_OK)
    {
        ioal_error_handler();
    }

    ioal_huart6->intf_gen_info.vdp_intf_inst_hdle = (void*)&huart6;
    ioal_huart6->intf_gen_info.state = IO_FREE_STATE;
}

/**
 * @brief USART1 Initialization Function
 */     
static void MX_USART1_Init(ioal_uart_hdle *ioal_huart1)
{

