antaris-inc/SatOS-HAL/drivers/exo_hal_driver_fw/exo_io_al_driver_api/exo_io_al_wrapper/exo_io_al_stm32f7xx/uart/src/exo_io_al_stm32f7xx_uart.c
/**
 * @brief Error callback event function
 */
void io_hal_stm32f7xx_uart2_error_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART2);
    if((ioal_huart->cb_context & UART_ERROR_CB)==LISR)
    {
        ioal_huart->error_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART2;
        uart_intr_hdlr_ipc.pld.pld_data=UART_ERROR_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief TX complete callback event function
 */
void io_hal_stm32f7xx_uart3_tx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART3);
    if((ioal_huart->cb_context & UART_TX_CPLT_CB)==LISR)
    {
        ioal_huart->tx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART3;
        uart_intr_hdlr_ipc.pld.pld_data=UART_TX_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief RX complete callback event function
 */
void io_hal_stm32f7xx_uart3_rx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART3);
    if((ioal_huart->cb_context & UART_RX_CPLT_CB)==LISR)
    {
        ioal_huart->rx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART3;
        uart_intr_hdlr_ipc.pld.pld_data=UART_RX_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort complete callback event function
 */
void io_hal_stm32f7xx_uart3_abort_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART3);
    if((ioal_huart->cb_context & UART_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART3;
        uart_intr_hdlr_ipc.pld.pld_data=UART_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort TX complete callback event function
 */
void io_hal_stm32f7xx_uart3_abort_tx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART3);
    if((ioal_huart->cb_context & UART_TX_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_tx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART3;
        uart_intr_hdlr_ipc.pld.pld_data=UART_TX_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort RX complete callback event function
 */
void io_hal_stm32f7xx_uart3_abort_rx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART3);
    if((ioal_huart->cb_context & UART_RX_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_rx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART3;
        uart_intr_hdlr_ipc.pld.pld_data=UART_RX_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Error callback event function
 */
void io_hal_stm32f7xx_uart3_error_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART3);
    if((ioal_huart->cb_context & UART_ERROR_CB)==LISR)
    {
        ioal_huart->error_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART3;
        uart_intr_hdlr_ipc.pld.pld_data=UART_ERROR_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief TX complete callback event function
 */
void io_hal_stm32f7xx_uart4_tx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART4);
    if((ioal_huart->cb_context & UART_TX_CPLT_CB)==LISR)
    {
        ioal_huart->tx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART4;
        uart_intr_hdlr_ipc.pld.pld_data=UART_TX_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief RX complete callback event function
 */
void io_hal_stm32f7xx_uart4_rx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART4);
    if((ioal_huart->cb_context & UART_RX_CPLT_CB)==LISR)
    {
        ioal_huart->rx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART4;
        uart_intr_hdlr_ipc.pld.pld_data=UART_RX_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort complete callback event function
 */
void io_hal_stm32f7xx_uart4_abort_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART4);
    if((ioal_huart->cb_context & UART_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART4;
        uart_intr_hdlr_ipc.pld.pld_data=UART_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort TX complete callback event function
 */
void io_hal_stm32f7xx_uart4_abort_tx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART4);
    if((ioal_huart->cb_context & UART_TX_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_tx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART4;
        uart_intr_hdlr_ipc.pld.pld_data=UART_TX_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort RX complete callback event function
 */
void io_hal_stm32f7xx_uart4_abort_rx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART4);
    if((ioal_huart->cb_context & UART_RX_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_rx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART4;
        uart_intr_hdlr_ipc.pld.pld_data=UART_RX_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Error callback event function
 */
void io_hal_stm32f7xx_uart4_error_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART4);
    if((ioal_huart->cb_context & UART_ERROR_CB)==LISR)
    {
        if(huart->ErrorCode & (HAL_UART_ERROR_ORE))
        {
            __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF);
        }
        ioal_huart->error_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART4;
        uart_intr_hdlr_ipc.pld.pld_data=UART_ERROR_CB;
        if(huart->ErrorCode & (HAL_UART_ERROR_RTO))
        {
            os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
        }
        if(huart->ErrorCode & (HAL_UART_ERROR_ORE))
        {
            os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
            __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF);
        }
    }
}

/**
 * @brief TX complete callback event function
 */
void io_hal_stm32f7xx_uart5_tx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART5);
    if((ioal_huart->cb_context & UART_TX_CPLT_CB)==LISR)
    {
        ioal_huart->tx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART5;
        uart_intr_hdlr_ipc.pld.pld_data=UART_TX_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief RX complete callback event function
 */
void io_hal_stm32f7xx_uart5_rx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART5);
    if((ioal_huart->cb_context & UART_RX_CPLT_CB)==LISR)
    {
        ioal_huart->rx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART5;
        uart_intr_hdlr_ipc.pld.pld_data=UART_RX_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort complete callback event function
 */
void io_hal_stm32f7xx_uart5_abort_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART5);
    if((ioal_huart->cb_context & UART_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART5;
        uart_intr_hdlr_ipc.pld.pld_data=UART_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort TX complete callback event function
 */
void io_hal_stm32f7xx_uart5_abort_tx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART5);
    if((ioal_huart->cb_context & UART_TX_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_tx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART5;
        uart_intr_hdlr_ipc.pld.pld_data=UART_TX_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort RX complete callback event function
 */
void io_hal_stm32f7xx_uart5_abort_rx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART5);
    if((ioal_huart->cb_context & UART_RX_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_rx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART5;
        uart_intr_hdlr_ipc.pld.pld_data=UART_RX_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Error callback event function
 */     
void io_hal_stm32f7xx_uart5_error_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART5);
    if((ioal_huart->cb_context & UART_ERROR_CB)==LISR)
    {
        ioal_huart->error_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART5;
        uart_intr_hdlr_ipc.pld.pld_data=UART_ERROR_CB;
        if(huart->ErrorCode & (HAL_UART_ERROR_RTO))
        {
            os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
        }
    }
}

/**
 * @brief TX complete callback event function
 */
void io_hal_stm32f7xx_uart6_tx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART6);
    if((ioal_huart->cb_context & UART_TX_CPLT_CB)==LISR)
    {
        ioal_huart->tx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART6;
        uart_intr_hdlr_ipc.pld.pld_data=UART_TX_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief RX complete callback event function
 */
void io_hal_stm32f7xx_uart6_rx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART6);
    if((ioal_huart->cb_context & UART_RX_CPLT_CB)==LISR)
    {
        ioal_huart->rx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART6;
        uart_intr_hdlr_ipc.pld.pld_data=UART_RX_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort complete callback event function
 */
void io_hal_stm32f7xx_uart6_abort_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART6);
    if((ioal_huart->cb_context & UART_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART6;
        uart_intr_hdlr_ipc.pld.pld_data=UART_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort TX complete callback event function
 */
void io_hal_stm32f7xx_uart6_abort_tx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART6);
    if((ioal_huart->cb_context & UART_TX_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_tx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART6;
        uart_intr_hdlr_ipc.pld.pld_data=UART_TX_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Abort RX complete callback event function
 */
void io_hal_stm32f7xx_uart6_abort_rx_cplt_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART6);
    if((ioal_huart->cb_context & UART_RX_ABORT_CPLT_CB)==LISR)
    {
        ioal_huart->abort_rx_cplt_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART6;
        uart_intr_hdlr_ipc.pld.pld_data=UART_RX_ABORT_CPLT_CB;
        os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
    }
}

/**
 * @brief Error callback event function
 */
void io_hal_stm32f7xx_uart6_error_cb(UART_HandleTypeDef *huart)
{
    os_itc_msg_handle_t uart_intr_hdlr_ipc;
    ioal_uart_hdle *ioal_huart = get_ioal_inst_hdle(IOAL_INST_UART6);
    if((ioal_huart->cb_context & UART_ERROR_CB)==LISR)
    {
        if(huart->ErrorCode & (HAL_UART_ERROR_ORE))
        {
            __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF);
        }
        ioal_huart->error_cb(ioal_huart);
    }
    else
    {
        uart_intr_hdlr_ipc.pld_info=IOAL_INST_UART6;
        uart_intr_hdlr_ipc.pld.pld_data=UART_ERROR_CB;
        if(huart->ErrorCode & (HAL_UART_ERROR_RTO))
        {
            os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
        }
        if(huart->ErrorCode & (HAL_UART_ERROR_ORE))
        {
            os_itc_msg_send(&uart_intr_hdlr_ipc,HAL_INTR_HDLR,0);
            __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF);
        }

    }
}

/**
 * @brief This API de-initialize the UART
 */
hal_ret_sts io_hal_stm32f7xx_uart_deinit(ioal_uart_hdle *ioal_huart)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    UART_HandleTypeDef *huart = ioal_huart->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK == HAL_UART_DeInit(huart))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}
